---
layout: post
title:  "O Líder e a Educação"
date:   2014-05-09 01:21:04
author: joaoseixas
categories: Lideranca
tags: liderança coaching equipe
---

<p>Vivemos na era da informa&ccedil;&atilde;o e temos muitos dados a disposi&ccedil;&atilde;o para tomar decis&otilde;es nas empresas e em nossas vidas, na area que atuo as pessoas costumam se intitular &quot;&quot;knowledge workers&quot;&quot; ou &quot;&quot;trabalhadores do conhecimento&quot;&quot;, em uma tradu&ccedil;&atilde;o livre. Estamos na era da gest&atilde;o do capital intelectual, onde queremos construir e preservar o conhecimento. O objetivo &eacute; facilitar o processo de transmiss&atilde;o e constru&ccedil;&atilde;o de conhecimento dentro das empresas e com isso buscar acima de tudo, inova&ccedil;&atilde;o. E para isso, cabe ao l&iacute;&shy;der o papel de facilitador do aprendizado e da constru&ccedil;&atilde;o do conhecimento.</p>

<h2><strong>Promovendo a constru&ccedil;&atilde;o do conhecimento</strong></h2>

<p>O ensino e o aprendizado n&atilde;o se reduz a transfer&ecirc;ncia de conhecimento. Na verdade a transfer&ecirc;ncia de conhecimento &eacute; apenas uma das etapas, e n&atilde;o &eacute; a mais importante. Promover condi&ccedil;&otilde;es para que o conhecimento seja constru&iacute;&shy;do pelo aprendiz &eacute; a coisa mais valiosa nessa rela&ccedil;&atilde;o. Nesse ponto, o l&iacute;&shy;der tem um papel fundamental e deve atuar pro-ativamente para que sua equipe tenha a possibilidade de construir o conhecimento. Cabe ao l&iacute;der orientar e conduzir, n&atilde;o s&oacute; com palavras, mas tamb&eacute;m com exemplos.</p>

<p>Al&eacute;m da palavra e do exemplo, outro ponto importante &eacute; o feedback. O l&iacute;der precisa fornecer um feedback constante para facilitar o processo de aprendizado. Somente dessa maneira o liderado saber&aacute; se conseguiu atingir o objetivo ou at&eacute; se superou a expectativa inicial do l&iacute;&shy;der. A avalia&ccedil;&atilde;o cr&iacute;&shy;tica, o exerc&iacute;&shy;cio do conhecimento e o acompanhamento da realiza&ccedil;&atilde;o da tarefa s&atilde;o fundamentais para constru&ccedil;&atilde;o do conhecimento.</p>

<h2><strong>Ensinar &eacute; pensar certo</strong></h2>

<p>Demorei a entender esse conceito a primeira vez que esbarrei nele. Pensar certo &eacute; submeter nossos conceitos e verdades a critica constante e deixar que elas sejam modificadas quando um conceito melhor vier a tona a partir das criticas. Isso significa que o conhecimento de hoje vai ser superado mais cedo ou mais tarde. Com isso o l&iacute;&shy;der pode e deve promover uma busca constante pela supera&ccedil;&atilde;o no n&iacute;&shy;vel de conhecimento, seu e dos seus liderados. Pensar certo &eacute; estar sempre preparado e buscando a mudan&ccedil;a, sempre em dire&ccedil;&atilde;o a constru&ccedil;&atilde;o de conceitos.</p>

<p>Na minha area &eacute; muito comum se adotar o novo apenas por ser novo, mas estar em constante mudan&ccedil;a e evolu&ccedil;&atilde;o n&atilde;o significa isso.&nbsp;Se trata de conhecer as op&ccedil;&otilde;es e escolher aquelas que agregam valor, assumindo o controle total de suas a&ccedil;&otilde;es. N&atilde;o &eacute; muito f&aacute;cil trilhar esse caminho, j&aacute; que temos aquela tend&ecirc;ncia a acomoda&ccedil;&atilde;o quando dominamos determinado conhecimento. &Eacute; preciso estar sempre construindo, &eacute; preciso pensar certo! Mas isso n&atilde;o &eacute; f&aacute;cil.</p>

<p>Voltando aos aspectos do l&iacute;der, pensar certo significa tamb&eacute;m respeitar os conhecimentos dos l&iacute;&shy;derados. Esse &eacute; um ponto em que muitos l&iacute;&shy;deres pecam. Cada um tem seu background de conhecimento e tem reflex&otilde;es diferentes sobre um mesmo tema, ent&atilde;o cabe ao l&iacute;&shy;der equacionar essas diferentes influ&ecirc;ncias e tirar proveito disso. Pensar certo &eacute; gostar das diferen&ccedil;as. Somente atrav&eacute;s das diferen&ccedil;as conseguimos construir novos conhecimentos, conseguimos formar uma equipe mais completa e atender a diferentes requisitos. Qualquer dia desses escreverei um pouco sobre motiva&ccedil;&atilde;o e forma&ccedil;&atilde;o de equipes, ent&atilde;o talvez eu consiga explicar um pouco como as diferen&ccedil;as s&atilde;o importantes. Aprenda a gostar das diferen&ccedil;as.</p>

<h2><strong>Ensinar &eacute; escutar tamb&eacute;m</strong></h2>

<p>O l&iacute;&shy;der deve dar espa&ccedil;o aos liderados e ouvir o que eles tem a dizer. S&oacute; assim existe a constru&ccedil;&atilde;o do conhecimento m&uacute;tuo. A comunica&ccedil;&atilde;o &eacute; fundamental no papel de lideran&ccedil;a, mas muitos esquecem que ouvir tamb&eacute;m faz parte da comunica&ccedil;&atilde;o que deve ser uma via de duas m&atilde;os. &nbsp;</p>