---
layout: post
title:  "Review do 1o Dojo na OnceDev"
date:   2014-04-05 17:51:38
author: pauloortins
categories: Eventos
tags: Coding_Dojo
---

<p>Acabo de chegar do primeiro dojo organizado pela OnceDev e eu n&atilde;o podia estar mais animado. Oportunidade de rever velhos amigos, conhecer gente nova e &eacute; claro, bater a resenha com o pessoal e &eacute; claro, escrever muito c&oacute;digo.</p>

<p>No &iacute;nicio do dojo, fiz uma apresenta&ccedil;&atilde;o r&aacute;pida explicando a import&acirc;ncia de se praticar programa&ccedil;&atilde;o e de onde surgiu e como funciona um Coding Dojo e logo depois uma apresenta&ccedil;&atilde;o r&aacute;pida das ferramentas que utilizamos (Node.js + Mocha + Should.js).</p>

<p>O problema escolhido foi a convers&atilde;o de n&uacute;mero romanos para n&uacute;meros decimais que foi resolvido completamente at&eacute; o final do dojo.</p>

<p>Criamos um reposit&oacute;rio para armazenar o c&oacute;digo dos coding dojos, voc&ecirc; pode acess&aacute;-lo <a href="http://github.com/Oncedev/coding-dojo">aqui</a>, a id&eacute;ia &eacute; usar esse reposit&oacute;rio para armazenar tanto os boilerplates utilizados no come&ccedil;o do dojo, tanto as solu&ccedil;&otilde;es desenvolvidas durante a sess&atilde;o e tamb&eacute;m solu&ccedil;&otilde;es que podem ter sido melhoradas ap&oacute;s o dojo.</p>

<p>Se voc&ecirc; est&aacute; planejando melhorar a solu&ccedil;&atilde;o que fizemos no dojo de hoje, n&atilde;o seja t&iacute;mido e fa&ccedil;a um pull request para o nosso reposit&oacute;rio, confesso que n&atilde;o resist&iacute; e j&aacute; fiz o meu !</p>

<p>Abaixo segue a retrospectiva e as fotos do dojo de hoje. Um grande abra&ccedil;o e n&atilde;o perca o pr&oacute;ximo dojo !</p>

<h3>Pontos Positivos</h3>

<ol>
        <li>Problema usado no dojo</li>
        <li>Linguagem</li>
        <li>Explica&ccedil;&atilde;o antes da programa&ccedil;&atilde;o</li>
        <li>TDD</li>
        <li>Conhecer novas abordagens</li>
        <li>An&aacute;lise do problema</li>
        <li>Solu&ccedil;&atilde;o colaborativa</li>
        <li>Ambiente</li>
        <li>Abordagem</li>
        <li>Recep&ccedil;&atilde;o</li>
        <li>Coffee Break</li>
        <li>Assunto</li>
        <li>Equipe</li>
        <li>Boa Din&acirc;mica</li>
        <li>Bom Aprendizado</li>
        <li>Galera</li>
        <li>Apresenta&ccedil;&atilde;o</li>
        <li>Empolga&ccedil;&atilde;o</li>
        <li>Aprendizado foi muito bom</li>
        <li>N&uacute;mero de pessoas</li>
        <li>Infraestrutura</li>
        <li>Linguagem</li>
        <li>Coffee Break</li>
        <li>TDD</li>
        <li>Networking</li>
        <li>Aprendizado de outras linguagens</li>
</ol>

<p>&nbsp;</p>

<h3>Pontos Negativos</h3>

<ol>
        <li>Tempo foi curto</li>
        <li>Pontualidade</li>
        <li>Poderia avan&ccedil;ar mais a solu&ccedil;&atilde;o</li>
        <li>Ilumina&ccedil;&atilde;o</li>
        <li>Ilumina&ccedil;&atilde;o</li>
        <li>Teclado ruim</li>
        <li>Visibilidade</li>
        <li>Teclado ruim</li>
        <li>Apagaram meu c&oacute;digo</li>
        <li>Dura&ccedil;&atilde;o</li>
</ol>

<p>&nbsp;</p>

<h3>Fotos</h3>

<p><img alt="" src="../img/blog/Bkd_SKiIQAAwv9o2.jpg" style="height:337px; width:599px" /></p>

<p><img alt="" src="../img/blog/image1.jpeg" style="height:450px; width:600px" /></p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>